CRUD - Pandas

In [1]:
import pandas as pd

datos={
    "nombre":["Anna", "Josefa", "Cecilia", "José", "Pablo"],
    "edad":[49, 76, 24, 32, 37],
    "sexo":["f", "f", "f", "m", "m"],
    "salario":[3000, 4000, 2000, 5000, 1300],
    "telefono":[1111111, 2222222, 3333333, 4444444, 5555555]
}

In [2]:
# Creacion
df=pd.DataFrame(datos)
df

    nombre  edad sexo  salario  telefono
0     Anna    49    f     3000   1111111
1   Josefa    76    f     4000   2222222
2  Cecilia    24    f     2000   3333333
3     José    32    m     5000   4444444
4    Pablo    37    m     1300   5555555

In [4]:
# Modificacion
altura=pd.Series([167, 154, 171, 181, 192])
altura

0    167
1    154
2    171
3    181
4    192
dtype: int64

In [5]:
df["altura"]=altura

In [6]:
df

    nombre  edad sexo  salario  telefono  altura
0     Anna    49    f     3000   1111111     167
1   Josefa    76    f     4000   2222222     154
2  Cecilia    24    f     2000   3333333     171
3     José    32    m     5000   4444444     181
4    Pablo    37    m     1300   5555555     192

In [7]:
altura=pd.Series([167, 154, 171, 181, 178])
df["altura"]=altura
df

    nombre  edad sexo  salario  telefono  altura
0     Anna    49    f     3000   1111111     167
1   Josefa    76    f     4000   2222222     154
2  Cecilia    24    f     2000   3333333     171
3     José    32    m     5000   4444444     181
4    Pablo    37    m     1300   5555555     178

In [9]:
# Lectura dataframe
df["nombre"]

0       Anna
1     Josefa
2    Cecilia
3       José
4      Pablo
Name: nombre, dtype: object

In [10]:
df.nombre

0       Anna
1     Josefa
2    Cecilia
3       José
4      Pablo
Name: nombre, dtype: object

In [11]:
# Eliminacion columna
del df['altura']
df

    nombre  edad sexo  salario  telefono
0     Anna    49    f     3000   1111111
1   Josefa    76    f     4000   2222222
2  Cecilia    24    f     2000   3333333
3     José    32    m     5000   4444444
4    Pablo    37    m     1300   5555555

In [13]:
# Guardar dataframe
df.to_csv("prueba_dataframe.csv")